#!/usr/bin/python
# -*- coding: utf-8 -*-

MESSAGES = {
    
    # main
    'basket_index_error': 'Внутренняя ошибка: передан неверный номер товара в корзине!',
    'basket_neg_quantity_error': 'Количество заказанных товаров должно быть позитивным (позиция № %d).',
    'basket_quantity_error': 'Задано неверное количество товара "%s" (позиция № %d).',
    
    'product_neg_number_error': 'Количество заказываемых товаров должно быть позитивным.',
    'product_number_error': 'Количество заказываемых товаров должно быть целым числом больше нуля.',
    'product_add_info': 'Добавлено в корзину "%s", %d шт.',
    'review_accepted_success': 'Ваш отзыв принят на рассмотрение',
    'order_emty_basket_error': 'Ваша корзина пуста. Пожалуйста, сначала закажите товар.',
    'order_success': 'Заказ %s создан. Заказано: %s',
    '': '',
    
    # info
    'review_accepted': 'Ваш коментарий принят к рассмотрению.',
    'message_accepted': 'Ваше сообщение принято к рассмотрению. Спасибо.',

}